app/controllers/admin_controller.rb

SELECT "employees".* FROM "employees"
---
  def accounts
  	@employee = Employee.all