app/controllers/employees_controller.rb

SELECT "employees".* FROM "employees"
---
  def index
  	# @employee = Employee.find(params[:id])
		@employees = Employee.all

SELECT  "organizations".* FROM "organizations" WHERE "organizations"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
INSERT INTO "employees" ("bank_account_id", "employee_id", "date_of_birth", "date_joined_company", "date_left_company", "gender", "job_title", "first_name", "middle_name", "last_name", "residential_address", "organization_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
  	@organization = Organization.find(params[:organization_id])
  	employee = Employee.new(employee_params)
  	@employee = @organization.employees << employee

SELECT "employees".* FROM "employees"
---
	def show
		# @employee = Employee.find(params[:id])
		@employees = Employee.all