app/controllers/employees_controller.rb

SELECT  "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
  def set_employee
  	@employee = Employee.find(params[:id])