app/controllers/organizations_controller.rb

SELECT  "organizations".* FROM "organizations" WHERE "organizations"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
  def find_organization
  	@organization = Organization.find(params[:id])