app/controllers/organizations_controller.rb

SELECT "organizations".* FROM "organizations"
---
  def index
  	@organizations = Organization.all

INSERT INTO "organizations" ("legal_name", "legal_entity_code", "logo", "tax_id_no", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["legal_name", ""], ["legal_entity_code", ""], ["logo", ""], ["tax_id_no", ""], ["created_at", 2016-11-22 16:51:36 UTC], ["updated_at", 2016-11-22 16:51:36 UTC]]
---
  def create
  	@organization = Organization.new(organization_params)
  	if @organization.save

SELECT "organizations".* FROM "organizations"
SELECT  "organizations".* FROM "organizations" WHERE "organizations"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
	def show
		@organizations = Organization.all
		@organization = Organization.find(params[:id])